src/Reports/СверкаРасчетовСПартнерами/СверкаРасчетовСПартнерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СверкаРасчетовСПартнерами</name>
</mdclass:Report>

src/Documents/СверкаВзаиморасчетов/СверкаВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СверкаВзаиморасчетов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСверокВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителяКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРуководителяКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасшифровкаПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасшифровкаПоПартнерам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасшифровкаПоДоговорам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеКонтрагента</name>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
        <types>DocumentRef.ОтчетКомитентуОСписании</types>
        <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
        <types>DocumentRef.ПоступлениеУслугПрочихАктивов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДолгПартнера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНашДолг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/СверкаРасчетовСПартнерами/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ДанныеОрганизации = Новый ТаблицаЗначений;
	
	ДанныеОрганизации.Колонки.Добавить("СверкаВзаиморасчетов");
	ДанныеОрганизации.Колонки.Добавить("РасчетныйДокумент");
	ДанныеОрганизации.Колонки.Добавить("ВалютаВзаиморасчетов");
	ДанныеОрганизации.Колонки.Добавить("ДанныеОрганизацииСуммаДолгПартнера");
	ДанныеОрганизации.Колонки.Добавить("ДанныеОрганизацииСуммаНашДолг");
	ДанныеОрганизации.Колонки.Добавить("СуммаДолгПартнера");
	ДанныеОрганизации.Колонки.Добавить("СуммаНашДолг");

	СверкиВзаиморасчетов = ПолучитьМассивСверокВзаиморасчетов();
	
	УстановитьПривилегированныйРежим(Истина);

	ДанныеДокумента = Документы.СверкаВзаиморасчетов.ВыборкаДанныхДокумента(СверкиВзаиморасчетов);
	
	Пока ДанныеДокумента.Следующий() Цикл
		
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеДокумента.Организация, ДанныеДокумента.Дата);
		ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, 
									"ПолноеНаименование");
		СведенияОКонтрагенте  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеДокумента.Контрагент,  ДанныеДокумента.Дата);
		КонтрагентНаименование = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, 
								  "ПолноеНаименование");
		
		СтруктураПредставленийУчастников = Новый Структура;
		СтруктураПредставленийУчастников.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		СтруктураПредставленийУчастников.Вставить("КонтрагентНаименование", КонтрагентНаименование);
	
		ТаблицаОстатковРасчетов = Документы.СверкаВзаиморасчетов.ОстаткиРасчетов(ДанныеДокумента);
		
		Если ТаблицаОстатковРасчетов <> Неопределено Тогда
			Для Каждого СтрокаЗадолженности Из ТаблицаОстатковРасчетов Цикл
				
				СтрокаДанныеОрганизации = ДанныеОрганизации.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДанныеОрганизации, СтрокаЗадолженности);
				
				СтрокаДанныеОрганизации.СверкаВзаиморасчетов = ДанныеДокумента.ДокументСсылка;
				СтрокаДанныеОрганизации.ДанныеОрганизацииСуммаДолгПартнера = СтрокаЗадолженности.СуммаДолгПартнера;
				СтрокаДанныеОрганизации.ДанныеОрганизацииСуммаНашДолг = СтрокаЗадолженности.СуммаНашДолг;

				Если ДанныеДокумента.РасшифровкаПоЗаказам Тогда
					СтрокаДанныеОрганизации.РасчетныйДокумент = Документы.СверкаВзаиморасчетов.ОписаниеРасчетногоДокумента(
						СтрокаЗадолженности.РасчетныйДокумент,
						СтрокаЗадолженности.НомерРасчетногоДокумента,
						СтрокаЗадолженности.ДатаРасчетногоДокумента,
						СтруктураПредставленийУчастников,
						(СтрокаЗадолженности.СуммаДолгПартнера > 0));
				Иначе
					СтрокаДанныеОрганизации.РасчетныйДокумент = "";
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
		
	КонецЦикла;
	
	ДокументРезультат.Очистить();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	СхемаВыводаРезультата = Отчеты.СверкаРасчетовСПартнерами.ПолучитьМакет("ВыводРезультата");
	
	Если ПолучитьФункциональнуюОпцию("БазоваяВерсия") Тогда
		НастройкиСхемы = СхемаВыводаРезультата.ВариантыНастроек.СверкаВзаиморасчетовБазовая.Настройки;
	Иначе
		НастройкиСхемы = СхемаВыводаРезультата.ВариантыНастроек.СверкаВзаиморасчетов.Настройки;
	КонецЕсли;
	
	#Область ПереносНастроекМакетаМеждуСхемами
		НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
		МакетОформления = НастройкиКомпоновщика.ПараметрыВывода.Элементы.Найти("МакетОформления").Значение;
		ИзменяемыйМакетОформления = НастройкиСхемы.ПараметрыВывода.Элементы.Найти("МакетОформления");
		ИзменяемыйМакетОформления.Значение = МакетОформления;
		ИзменяемыйМакетОформления.Использование = Истина;
	#КонецОбласти 
	
	ЗначениеПараметра = НастройкиСхемы.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СверкиВзаиморасчетов"));
	ЗначениеПараметра.Значение = СверкиВзаиморасчетов;

	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаВыводаРезультата, 
		НастройкиСхемы,
		ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(
		МакетКомпоновки,
		Новый Структура("ДанныеОрганизации", ДанныеОрганизации),
		ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	ВспомогательныеПараметры = Новый Массив;
	КомпоновкаДанныхСервер.ДобавитьВспомогательныеПараметрыОтчетаПоФункциональнымОпциям(ВспомогательныеПараметры);
	КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметры);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьМассивСверокВзаиморасчетов()
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаСверокВзаиморасчетов = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаСверокВзаиморасчетов.ВыгрузитьКолонку("СверкаВзаиморасчетов");
	
КонецФункции

#КонецОбласти

#КонецЕсли
